Repository: MrutyunjayaPandaLWS/HoyaThailandIOS
Catalog: Hoya Thailand/Resources/Language/*.lproj/Localizable.strings
Languages: th

# language
source: En
th: Th

source: Congratulations !
th: ยินดีด้วย!

# noInternet
source: Please check your internet connection!
th: กรุณาตรวจสอบสัญญาณอินเตอร์เน็ตของท่าน!

# otp_message
source: OTP has been sent to your registered mobile number.
th: เลข OTP ได้ทำการส่งไปยังหมายเลขโทรศัพท์ที่ท่านลงทะเบียนไว้

source: Enter OTP
th: กรอกหมายเลข OTP ที่ท่านได้รับ

source: Resend OTP?
th: ส่งเลข OTP อีกครั้ง?

source: Submit
th: ยืนยัน

# choose_language
source: Choose Your Language
th: เลือกภาษา

source: Filter
th: ตัวกรอง

source: Select Status
th: กรุณาเลือกสถานะ

source: Reset
th: รีเซ็ต

# filter_toast_message
source: Select Date Range
th: กรุณาเลือกเขตข้อมูล

source: Login
th: กรุณาลงชื่อเข้าสู่ระบบ

source: Enter a valid password
th: ป้อนรหัสผ่านที่ถูกต้อง

# Mobile_number_is_doesn't_exists
source: Membership ID / Mobile number is doesn't exists
th: ไม่มีรหัสสมาชิก / เบอร์มือถือ

# account_Deactivate_error
source: Your account is deactivate please contact to your administrator
th: บัญชีของคุณถูกปิดใช้งาน โปรดติดต่อผู้ดูแลระบบของคุณ

# account_Pending_error
source: Your account verification is pending, please contact to your administrator
th: การยืนยันบัญชีของคุณอยู่ระหว่างดำเนินการ โปรดติดต่อผู้ดูแลระบบของคุณ

# account_login_error
source: Your account login is faild, please contact to your administrator
th: การเข้าสู่ระบบบัญชีของคุณล้มเหลว โปรดติดต่อผู้ดูแลระบบของคุณ

source: Password is incorrect
th: รหัสผ่านไม่ถูกต้อง

# loginInfo
source: Enter given details to login the account
th: ป้อนรายละเอียดที่กำหนดเพื่อเข้าสู่ระบบบัญชี

# userId
source: Membership ID / Mobile Number
th: หมายเลขสมาชิก / หมายเลขโทรศัพท์มือถือ

# userId_toast_message
source: Enter Membership ID / Mobile Number
th: กรุณากรอกหมายเลขสมาชิก / หมายเลขโทรศัพท์มือถือ

source: Password
th: รหัสผ่าน

# password_toast_message
source: Enter password
th: กรุณากรอกรหัสผ่านของท่าน

source: Forgot Password
th: ลืมรหัสผ่าน

source: Register
th: ลงทะเบียน

# don't_have_account
source: Don't have an Account?
th: คุณยังไม่ได้เป็นสมาชิกใช่ไหม?

source: Need Help?
th: ต้องการความช่วยเหลือ?

# forgot_password_info
source: Enter the given details to Reset your Password
th: ป้อนรายละเอียดที่กำหนดเพื่อรีเซ็ตรหัสผ่านของคุณ

# forgot_password_toast_message
source: Enter the given details to Reset your Password
th: ป้อนรายละเอียดที่กำหนดเพื่อรีเซ็ตรหัสผ่านของคุณ

source: Send OTP
th: ส่งเลข OTP

# back_Login
source: Back to Login
th: กลับไปหน้าลงชื่อเข้าใช้งาน

# forgot_password_success_Message
source: Password has been sent to the registered Mobile Number.
th: รหัสผ่านได้ถูกส่งไปยังหมายเลขโทรศัพท์ที่ท่านได้ทำการลงทะเบียนไว้.

# register_info
source: Enter the given details to register
th: กรอกรายละเอียดที่กำหนดเพื่อลงทะเบียน

source: Account Type
th: ประเภทบัญชี

# stoeId
source: Store ID
th: รหัสร้านค้า

# storeId_toast_message
source: Enter Store ID
th: กรุณากรอกรหัสร้านค้า

source: Store Name
th: ชื่อร้านค้า

# storeName_toast_message
source: Enter Store Name
th: กรุณากรอกชื่อร้านค้า

source: Role
th: บทบาท

source: First Name
th: ชื่อ

# firstName_toast_message
source: Enter First Name
th: กรุณากรอกชื่อ

source: Last Name
th: นามสกุล

# lastName_toast_message
source: Enter Last Name
th: กรุณากรอกนามสกุล

source: Email
th: อีเมล์

# email_toast_message
source: Enter Email
th: กรุณากรอกอีเมล์

# email_validation
source: This Email already exist try another email
th: อีเมลนี้มีอยู่แล้ว ลองอีเมลอื่น

# wrong_email_format
source: Enter a valid email
th: ป้อนอีเมลที่ถูกต้อง

source: Mobile Number
th: หมายเลขโทรศัพท์มือถือ

# mobileNumber_toast_message
source: Enter Mobile Number
th: กรุณากรอกหมายเลขโทรศัพท์มือถือ

# mobileNumbervalidation
source: Please enter valid mobile number!
th: โปรดป้อนหมายเลขโทรศัพท์มือถือที่ถูกต้อง!

# wrong_idCard_message
source: Please enter valid ID card number!
th: กรุณากรอกหมายเลขบัตรประชาชนที่ถูกต้อง!

source: Sales Representative
th: ตัวแทนฝ่ายขาย

# sales_representative_toast_message
source: Select Sales Representative
th: เลือกตัวแทนฝ่ายขาย

source: Set Password
th: ตั้งค่ารหัสผ่าน

source: DOB
th: วัน เดือน ปี เกิด

# DOB_toast_message
source: Select DOB
th: เลือก วัน เดือน ปี เกิด

source: Gender
th: เพศ

# gender_toast_message
source: Select gender
th: เพศ

source: ID Card Number
th: หมายเลขบัตรประชาชน

# idCardNumber_toast_message
source: Enter ID card number
th: กรุณากรอกหมายเลขบัตรประชาชน

# register_success_Message
source: You have registered successfully.
th: คุณลงทะเบียนสำเร็จ

# registrationFailed
source: This storeID already registered, please try other storeID
th: StoreID นี้ลงทะเบียนแล้ว โปรดลองใช้ StoreID อื่น

source: Membership ID
th: หมายเลขสมาชิก

# membershipId_toast_message
source: Enter Membership ID
th: กรุณากรอกหมายเลขสมาชิก

source: Query Topic
th: หัวข้อของการแจ้งปัญหา

# queryTopic_toast_message
source: Select Query Topic
th: เลือกหัวข้อการแจ้งปัญหา

# query_summery
source: Query Summary
th: สรุปรายการแจ้งปัญหาทั้งหมด

# query_summery_toast_message
source: Enter Query Summary
th: ป้อนค่าหัวเรื่องของปัญหาเพื่อใช้ในการค้นหา

source: Help
th: ช่วยเหลือ

source: Upload a proof
th: อัปโหลดหลักฐาน

source: Upload Image
th: อัปโหลดรูปภาพ

# querySubmit_success_message
source: Your query has been submitted successfully.
th: ส่งคำถามของคุณเรียบร้อยแล้ว

source: Query
th: สอบถาม

source: New Query
th: เพิ่มการแจ้งปัญหาใหม่

# newQueryInfo
source: Please submit your query using the form
th: โปรดยืนยันการแจ้งปัญหาของคุณโดยผ่านแบบฟอร์ม

source: Query Details
th: รายละเอียดของปัญหา

# queryDetails_toast_message
source: Enter your query details
th: กรอกรายละเอียดปัญหาที่คุณพบ

source: Browse Image
th: เรียกดูรูปภาพ

source: Submit Query
th: ทำการยืนยันปัญหาที่ท่านแจ้งแล้ว

source: Points
th: คะแนน

# scan_upload_invoice
source: Scan the QR / Upload Invoice
th: สแกน QR / อัพโหลดใบกำกับภาษี

# myEarning
source: My Earnings
th: รายได้ของฉัน

# redeem_Voucher
source: Redeem the e-Voucher
th: แลกบัตรกำนัลอิเล็กทรอนิกส์

# myredeemption
source: My Redemption
th: การแลกของฉัน

# pointExpireReport
source: Points Expiry Report
th: รายงานของคะแนนที่หมดอายุ

source: Offer Details
th: รายละเอียดข้อเสนอ

source: My Promotions
th: โปรโมชั่นของฉัน

# date_of_Aniversary
source: Date of Anniversary
th: วันครบรอบ

# date_of_aniversary_toast_message
source: select Date of Anniversary
th: วันครบรอบ

source: Update
th: ปรับปรุง

source: My Profile
th: ประวัติของฉัน

# general_info
source: General Information
th: ข้อมูลทั่วไป

# personal_info
source: Personal Information
th: ข้อมูลส่วนตัว

# profile_update_success_message
source: Your profile has been updated successfully.
th: ประวัติของคุณทำการปรับปรุงเรียบร้อยแล้ว

source: Promotion List
th: รายการโปรโมชั่น

source: Details
th: รายละเอียด

source: Claim
th: การเคลม

# validUntli
source: Valid till
th: ใช้ได้ถึง

source: Promotion Details
th: รายละเอียดโปรโมชั่น

# promotionValid
source: Promotion Valid till
th: โปรโมชั่นใช้ได้จนถึง

# getBenefit
source: Get Benefits
th: รับสิทธิประโยชน์

# promotionDetails_info
source: When scan the QR or Upload the invoice
th: เมื่อสแกน QR หรืออัปโหลดใบแจ้งหนี้

source: My Earnings
th: รายได้ของฉัน

source: Promotion Name
th: ชื่อโปรโมชั่น

source: Date
th: วันที่

source: Product Name
th: ชื่อสินค้า

# invoiceNumer
source: Invoice Number
th: หมายเลขใบกำกับภาษี

# point_will_expire
source: Points will expire on
th: คะแนนจะหมดอายุในวันที่

source: Remarks
th: หมายเหตุ

source: Select Promotion Name
th: เลือกชื่อโปรโมชัน

# e_voucher
source: e-Vouchers
th: บัตรกำนัลอิเล็กทรอนิกส์

# availableBal
source: Available Balance
th: ยอดคงเหลือ

source: will expire on
th: จะหมดอายุวันที่

source: Redeem
th: การแลก

source: Status
th: สถานะ

source: Voucher Name
th: ชื่อบัตรกำนัล

# downloadVoucher
source: Download the voucher
th: ดาวน์โหลดบัตรกำนัล

source: My Staff
th: พนักงานของฉัน

source: Point Balance
th: ยอดคะแนนคงเหลือ

source: Enrollment Date
th: วันที่ลงทะเบียน

source: View
th: มุมมอง

source: Offers
th: ข้อเสนอ

source: Offer Details
th: รายละเอียดข้อเสนอ

source: Notifications
th: การแจ้งเตือน

source: Redeem the e-Voucher
th: แลกบัตรกำนัลอิเล็กทรอนิกส์

source: Scan Code
th: สแกนรหัส

source: Cancel
th: ยกเลิก

source: Quantity
th: จำนวน

source: Support
th: การสนับสนุน

source: Home
th: หน้าหลัก

source: Profile
th: ประวัติ

source: Valid till
th: ใช้ได้ถึง

source: Terms And Condition
th: ข้อกำหนดและเงื่อนไข

source: Lens Design
th: การออกแบบเลนส์

# accept terms and condition
source: Accept Terms And Conditions
th: ยอมรับข้อกำหนดและเงื่อนไข

source: Are you sure you want to Logout ?
th: คุณแน่ใจว่าคุณต้องการที่จะออกจากระบบ ?

source: Logout
th: ออกจากระบบ

source: Yes
th: ใช่

source: No
th: เลขที่

source: Ok
th: ตกลง

source: Account deleted successfully
th: ลบบัญชีเรียบร้อยแล้ว

# are_sure_delete_account
source: Are you sure you really want to delete your account?
th: คุณแน่ใจหรือว่าต้องการลบบัญชีของคุณจริงๆ

source: Delete
th: ลบ

source: Delete Account
th: ลบบัญชี

# idCardExistancy
source: Id no already exist !
th: ไม่มีรหัสอยู่แล้ว !

# something_went_wrong
source: Something went to wrong, please try after some time...
th: เกิดข้อผิดพลาด โปรดลองอีกครั้งในภายหลัง...

source: Your voucher redeemed successfully
th: แลกบัตรกำนัลของคุณสำเร็จแล้ว

source: Earned Points
th: คะแนนที่ได้รับ

source: Redeemed Points
th: คะแนนแลก

source: Expired Points
th: คะแนนหมดอายุ

source: Available Points
th: คะแนนที่มีอยู่

source: No data found!
th: ไม่พบข้อมูล!

source: Claim Details
th: รายละเอียดการเรียกร้อง

source: Upload Code
th: อัปโหลดรหัส

source: Validity until
th: ใช้ได้ถึง

source: Enter your invoice number
th: ป้อนหมายเลขใบแจ้งหนี้ของคุณ

source: Select the product name
th: เลือกชื่อผลิตภัณฑ์

source: Enter a quantity
th: ป้อนปริมาณ

source: Hoya Application need Camera permission for Scanning Codes
th: แอปพลิเคชัน Hoya ต้องได้รับอนุญาตจากกล้องสำหรับการสแกนรหัส

source: Allow Camera Access
th: อนุญาตการเข้าถึงกล้อง

source: Allow
th: อนุญาต

source: DisAllow
th: ไม่อนุญาต

source: lens design name is not available
th: ไม่มีชื่อการออกแบบเลนส์

source: Scan a valid QR Code
th: สแกนรหัส QR ที่ถูกต้อง

source: Summitted Len Design is not available
th: ไม่มีการออกแบบเลนส์ที่ส่งมา

source: This combination already exist
th: มีชุดค่าผสมนี้อยู่แล้ว

source: Claim request has been submitted successfully
th: ส่งคำขอเรียกร้องเรียบร้อยแล้ว

source: Invalid claim request
th: คำขอเรียกร้องไม่ถูกต้อง

# userId_1
source: Membership ID
th: รหัสสมาชิก

# userId_toast_message_1
source: Enter Membership ID
th: ใส่รหัสสมาชิก

source: Pin has been sent to registered mobile number
th: ส่ง PIN ไปที่เบอร์มือถือที่ลงทะเบียนแล้ว

# Mobile_number_is_doesn't_exists1
source: Membership ID is doesn't exists
th: ไม่มีรหัสสมาชิก
